In [7]:
import pandas as pd

# Data concatenation
stacking dataframes on top of each other(rows) or side by side(columns)

In [8]:
df1 = pd.DataFrame({
    "id": [1,2,3],
    "name": ["Adaam", "Bob", "Charlie"]
})

df2 = pd.DataFrame({
    "id": [4,5,6],
    "name": ["Rakib", "Ehsan", "Murphy"]
})

df1

   id     name
0   1    Adaam
1   2      Bob
2   3  Charlie

In [9]:
df2

   id    name
0   4   Rakib
1   5   Ehsan
2   6  Murphy

In [16]:
row_concat = pd.concat([df1, df2], ignore_index=True)
row_concat

   id     name
0   1    Adaam
1   2      Bob
2   3  Charlie
3   4    Rakib
4   5    Ehsan
5   6   Murphy

In [19]:
col_concat = pd.concat([df1, df2], axis=1)
col_concat

   id     name  id    name
0   1    Adaam   4   Rakib
1   2      Bob   5   Ehsan
2   3  Charlie   6  Murphy